10/data/attachments/a4b9769e7fc5d314.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Devon_loss_Friend_92186_5</nif:username>
            <nif:friendToBeRequested>soap_friends_47580c54-8541-4191-83be-e518dcba4b04</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>